read_verilog cpu.v alu.v reg_file.v branch_controller_ALU.v check_misalign.v control.v mux.v mux4input.v pc_plus4.v 
synth_xilinx -top cpu
write_verilog cpu_synth.v
